import { Container } from 'react-bootstrap';

function TermsServicePage() {
  return (
    <Container>
      <br />
      <h2>서비스 이용</h2>
      <h4>
        서비스의 제공 및 변경 1. 회사는 회사가 제공하는 서비스에서 진행하는 콘텐츠와 이벤트 등의 모든 서비스를 회원에게
        제공합니다. 2. 회사에서 제공하는 서비스는 기본적으로 무료입니다. 유료서비스 추가 시 사전 공지하며 이용에 대한
        사항은 회사가 별도로 정한 서비스 약관 및 정책 또는 운영규칙에 따릅니다. 3. 회사는 서비스 변경 시 그 변경될
        서비스의 내용 및 제공일자를 회원에게 통지합니다.
      </h4>{' '}
      <br />
      <h2>정보의 제공 및 통지</h2>
      <h4>
        1. 회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항 혹은 전자우편 등의 방법으로 회원에게
        제공할 수 있습니다. 2. 회사는 불특정다수 회원에 대한 통지를 하는 경우 7일 이상 공지 게시판에 게시함으로써 개별
        통지에 갈음할 수 있습니다.{' '}
      </h4>
      <br />
      <h2>게시물의 저작권 및 관리</h2>
      <h4>
        {' '}
        1. 회사는 회원의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다. 다만, 다음 각
        호에 해당하는 게시물이나 자료의 경우 사전통지 없이 삭제하거나 이동 또는 등록 거부를 할 수 있으며, 해당 회원의
        자격을 제한, 정지 또는 상실시킬 수 있습니다. i.다른 회원 또는 제3자에게 심한 모욕을 주거나 명예를 손상시키는
        내용인 경우 ii.공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우 iii.불법복제 또는 해킹을
        조장하는 내용인 경우 iv.영리를 목적으로 하는 광고일 경우 v.범죄적 행위에 결부된다고 인정되는 내용인 경우
        vi.회사나 다른 회원의 저작권 혹은 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우 vii.회사에서 규정한 게시물
        원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우 viii.스팸성 게시물인 경우 ix.기타 관계법령에 위배된다고
        판단되는 경우 2. 회사가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 회사에 귀속됩니다. 3. 회원이 서비스
        화면 내에 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 또한 회사는 게시자의 동의 없이 게시물을
        상업적으로 이용할 수 없습니다. 다만, 비영리 목적인 경우는 그러하지 아니하며, 또한 본 사이트 내에서의 게재권을
        갖습니다. 4. 회원은 서비스를 이용하여 취득한 정보를 회사의 사전 승낙 없이 임의가공, 판매, 복제, 송신, 출판,
        배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
      </h4>{' '}
      <br />
    </Container>
  );
}

export default TermsServicePage;
